In [1]:
import pandas as pd

In [55]:
df = pd.read_csv("data.csv")

In [57]:
df

      name school  age  film   mob  roll
0  Deepika    BSC   20    gg    ge     3
1   Sakshi    JIC   33   ref  tftf     4
2    rakhi    ghu   77  r4r4   y77     5
3    aditi     tt   77  gerr    tt     6

In [63]:
df["name"]

0    Deepika
1     Sakshi
2      rakhi
3      aditi
Name: name, dtype: object

In [65]:
df["age"]

0    20
1    33
2    77
3    77
Name: age, dtype: int64

In [69]:
df[["name","age"]]

      name  age
0  Deepika   20
1   Sakshi   33
2    rakhi   77
3    aditi   77

In [71]:
df.loc[1] #find the first row

name      Sakshi
school       JIC
age           33
film         ref
mob         tftf
roll           4
Name: 1, dtype: object

In [73]:
df.loc[0]

name      Deepika
school        BSC
age            20
film           gg
mob            ge
roll            3
Name: 0, dtype: object

In [81]:
df.loc[3 , "roll"]  # use lable

6

In [83]:
df.iloc[3 , 5]# use index

6

In [85]:
df.loc[0:2, ["name", "age"]] #row and column

      name  age
0  Deepika   20
1   Sakshi   33
2    rakhi   77

In [92]:
df.iloc[0:2, 0:2]

      name school
0  Deepika    BSC
1   Sakshi    JIC

In [96]:
df.at[0,"age"] #fast method

20

In [116]:
df[df["age"]>5]

      name school  age  film   mob  roll
0  Deepika    BSC   20    gg    ge     3
1   Sakshi    JIC   33   ref  tftf     4
2    rakhi    ghu   77  r4r4   y77     5
3    aditi     tt   77  gerr    tt     6

In [122]:
df[(df["age"]>4) & (df["roll"]>2)]

      name school  age  film   mob  roll
0  Deepika    BSC   20    gg    ge     3
1   Sakshi    JIC   33   ref  tftf     4
2    rakhi    ghu   77  r4r4   y77     5
3    aditi     tt   77  gerr    tt     6

In [137]:
df.query( " age > 11 and name == 'Deepika' ")

      name school  age film mob  roll
0  Deepika    BSC   20   gg  ge     3